In [247]:
import pandas as pd
import pyodbc 
conn = pyodbc.connect('Driver={SQL Server};'
                      'Server=RON\SQLEXPRESS;'
                      'Database=TestDB;'
                      'Trusted_Connection=yes;')

cursor = conn.cursor()

sql_query = pd.read_sql_query('SELECT * FROM TestDB.dbo.Person',conn)
sql_query.to_csv('output.csv')

In [41]:
output=pd.read_csv(r'C:\Users\syedkhadarvalli\output.csv')
output.head()

,Unnamed: 0,customer_id,name,email,membership_age,revenue,preferred_film_language,preferred_film_category,city_id,city,preferred_film_year
0,0,1,MARY_SMITH,MARY.SMITH@sakilacustomer.org,0 days 06:52:44.000000000,118.68,"English,Italian,Japanese,Mandarin,French","Sports,Sci-Fi,Animation,Drama,Comedy",463,Sasebo,00s
1,1,2,PATRICIA_JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,0 days 06:52:44.000000000,128.73,"English,Italian,Japanese,Mandarin,French","Sports,Sci-Fi,Animation,Drama,Comedy",449,San Bernardino,00s
2,2,3,LINDA_WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,0 days 06:52:44.000000000,135.74,"English,Italian,Japanese,Mandarin,French","Sports,Sci-Fi,Animation,Drama,Comedy",38,Athenai,00s
3,3,4,BARBARA_JONES,BARBARA.JONES@sakilacustomer.org,0 days 06:52:44.000000000,81.78,"English,Italian,Japanese,Mandarin,French","Sports,Sci-Fi,Animation,Drama,Comedy",349,Myingyan,00s
4,4,5,ELIZABETH_BROWN,ELIZABETH.BROWN@sakilacustomer.org,0 days 06:52:44.000000000,144.62,"English,Italian,Japanese,Mandarin,French","Sports,Sci-Fi,Animation,Drama,Comedy",361,Nantou,00s

# Desired Output.csv file making by using python

In [66]:
out=pd.DataFrame()

# 1.customer_id

In [67]:
customer=pd.read_csv(r'C:\Users\syedkhadarvalli\Desktop\mysql-sakila-db\customer.csv')

out['customer_id']=customer['customer_id']

# 2. name

In [68]:
out['name']=customer['first_name']+'_'+customer['last_name']

# 3.email

In [69]:
out['email']=customer['email']

# 4.membership_age

In [70]:
customer['create_date']=pd.to_datetime(customer['create_date'])
customer['last_update']=pd.to_datetime(customer['last_update'])

In [71]:
out['membership_age']=customer['last_update']-customer['create_date']

# 5.revenue

In [72]:
payment=pd.read_csv(r'C:\Users\syedkhadarvalli\Desktop\mysql-sakila-db\payment.csv')

out['revenue']=payment.groupby('customer_id')['amount'].sum().tolist()

# 6.preferred_film_language

In [73]:
language=pd.read_csv(r'C:\Users\syedkhadarvalli\Desktop\mysql-sakila-db\language.csv')

language['name']

0     English
1     Italian
2    Japanese
3    Mandarin
4      French
5      German
Name: name, dtype: object

In [74]:
out['preferred_film_language']="English,Italian,Japanese,Mandarin,French"

# 7.preferred_film_category

In [75]:
sales_by_film_category=pd.read_csv(r'C:\Users\syedkhadarvalli\Desktop\mysql-sakila-db\views\sales_by_film_category.csv')
sales_by_film_category.head()

    category  total_sales
0     Sports      5314.21
1     Sci-Fi      4756.98
2  Animation      4656.30
3      Drama      4587.39
4     Comedy      4383.58

In [76]:
out['preferred_film_category']='Sports,Sci-Fi,Animation,Drama,Comedy'

# 8.city_id

In [78]:
address=pd.read_csv(r'C:\Users\syedkhadarvalli\Desktop\mysql-sakila-db\address.csv')
city=pd.read_csv(r'C:\Users\syedkhadarvalli\Desktop\mysql-sakila-db\city.csv')

In [79]:
p=pd.merge(customer,address,how='inner',on=['address_id'])
p=pd.merge(p,city,how='inner',on=['city_id'])
p[['customer_id','city_id','city']].head()

   customer_id  city_id            city
0            1      463          Sasebo
1            2      449  San Bernardino
2            3       38         Athenai
3            4      349        Myingyan
4            5      361          Nantou

In [80]:
out['city_id']=p['city_id']

# 9.preferred_film_year

In [81]:
film=pd.read_csv(r'C:\Users\syedkhadarvalli\Desktop\mysql-sakila-db\film.csv')
film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [82]:
y=[]
for i in film.release_year:
    if i > 2010:
        y.append('New')
    elif i > 2000:
        y.append('00s')
    elif i > 1990:
        y.append('90s')
    elif i < 1990:
        y.append('old')

In [64]:
out['preferred_film_year']=y

In [65]:
out.head()

,customer_id,name,email,membership_age,revenue,preferred_film_language,preferred_film_category,city_id,preferred_film_year
0,1,MARY_SMITH,MARY.SMITH@sakilacustomer.org,06:52:44,118.68,"English,Italian,Japanese,Mandarin,French","Sports,Sci-Fi,Animation,Drama,Comedy",463,00s
1,2,PATRICIA_JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,06:52:44,128.73,"English,Italian,Japanese,Mandarin,French","Sports,Sci-Fi,Animation,Drama,Comedy",449,00s
2,3,LINDA_WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,06:52:44,135.74,"English,Italian,Japanese,Mandarin,French","Sports,Sci-Fi,Animation,Drama,Comedy",38,00s
3,4,BARBARA_JONES,BARBARA.JONES@sakilacustomer.org,06:52:44,81.78,"English,Italian,Japanese,Mandarin,French","Sports,Sci-Fi,Animation,Drama,Comedy",349,00s
4,5,ELIZABETH_BROWN,ELIZABETH.BROWN@sakilacustomer.org,06:52:44,144.62,"English,Italian,Japanese,Mandarin,French","Sports,Sci-Fi,Animation,Drama,Comedy",361,00s

In [192]:
l=['actor','address','category','city','country','customer','film','film_actor','film_category','film_text','inventory','language','payment','rental','staff','store']
for i in l:
    i=pd.read_csv((r'C:\Users\syedkhadarvalli\Desktop\mysql-sakila-db\{}.csv').format(i))
    print(i.columns)

Index(['actor_id', 'first_name', 'last_name', 'last_update'], dtype='object')
Index(['address_id', 'address', 'address2', 'district', 'city_id',
       'postal_code', 'phone', 'last_update'],
      dtype='object')
Index(['category_id', 'name', 'last_update'], dtype='object')
Index(['city_id', 'city', 'country_id', 'last_update'], dtype='object')
Index(['country_id', 'country', 'last_update'], dtype='object')
Index(['customer_id', 'store_id', 'first_name', 'last_name', 'email',
       'address_id', 'active', 'create_date', 'last_update'],
      dtype='object')
Index(['film_id', 'title', 'description', 'release_year', 'language_id',
       'original_language_id', 'rental_duration', 'rental_rate', 'length',
       'replacement_cost', 'rating', 'special_features', 'last_update'],
      dtype='object')
Index(['actor_id', 'film_id', 'last_update'], dtype='object')
Index(['film_id', 'category_id', 'last_update'], dtype='object')
Index(['film_id', 'title', 'description'], dtype='object')
Index(['inventory_id', 'film_id', 'store_id', 'last_update'], dtype='object')
Index(['language_id', 'name', 'last_update'], dtype='object')
Index(['payment_id', 'customer_id', 'staff_id', 'rental_id', 'amount',
       'payment_date', 'last_update'],
      dtype='object')
Index(['rental_id', 'rental_date', 'inventory_id', 'customer_id',
       'return_date', 'staff_id', 'last_update'],
      dtype='object')
Index(['staff_id', 'first_name', 'last_name', 'address_id', 'picture', 'email',
       'store_id', 'active', 'username', 'password', 'last_update'],
      dtype='object')
Index(['store_id', 'manager_staff_id', 'address_id', 'last_update'], dtype='object')

In [231]:
c=pd.merge(film_category,film,how='left',on=['customer_id'])
c[['customer_id','create_date','rental_date','return_date']].tail()

,customer_id,create_date,rental_date,return_date
16039,599,2006-02-14 22:04:37,2005-08-21 17:43:42,2005-08-22 18:53:42
16040,599,2006-02-14 22:04:37,2005-08-21 21:41:57,2005-08-25 20:37:57
16041,599,2006-02-14 22:04:37,2005-08-23 06:09:44,2005-09-01 06:53:44
16042,599,2006-02-14 22:04:37,2005-08-23 11:08:46,2005-08-25 07:25:46
16043,599,2006-02-14 22:04:37,2005-08-23 11:25:00,2005-08-26 11:46:00

In [184]:
"""l=pd.merge(film, film_actor,how='inner',on=['film_id'])
l=pd.merge(l,film_category,how='inner',on=['film_id'])
l=pd.merge(l, film_text,how='inner',on=['film_id'])
l=pd.merge(l, inventory,how='inner',on=['film_id'])
l.head()
#l.columns.tolist()

#l[['film_id','release_year','rental_rate','category_id']].head()"""

"l=pd.merge(film, film_actor,how='inner',on=['film_id'])\nl=pd.merge(l,film_category,how='inner',on=['film_id'])\nl=pd.merge(l, film_text,how='inner',on=['film_id'])\nl=pd.merge(l, inventory,how='inner',on=['film_id'])\nl.head()\n#l.columns.tolist()\n\n#l[['film_id','release_year','rental_rate','category_id']].head()"